# Live Project:


### Eyeballing information:

###### 1.) File format is excel
###### 2.) There are 5 sheets: Analysis Summary, Expenses details, Inward Cash Flow. Bank Account Reconsilition, Details
###### 3.) Details tells the categorisation of Expence type and Exp Source
###### 4.) There are multiple unnecessary blank spaces
###### 5.) Expence Detials is based on only counter book (ONLY)
###### 6.) The range of Expence data is from 1st Jan 2023 to 21st July 2023
###### 7.) Difference in Total Expence(24,20,492) and  Cash Inflow(64,79,004) is 40,58,512


### What to do:

###### 1.)Using pandas is recommended for data cleaning
###### 2.)Check for missing values or missing data
###### 3.)Removal of unncessary column is advised
###### 4.)Removal of seperation rows in advised

In [1]:
import pandas as pd #imported pandas
import numpy as np #imported numpy
np.set_printoptions(suppress = True,
                   linewidth = 100,
                   precision = 2)

In [2]:
expense_details = pd.read_excel("Sales Summary.xlsx", sheet_name="Expenses details")

In [3]:
expense_details

           Date Month         Expense Details  Amount   Catagory    Exp Source
0    2023-01-01   Jan             HPGas big 1  1950.0     02_Gas  Counter Book
1    2023-01-01   Jan            Live singing  5000.0    03_Misc  Counter Book
2    2023-01-01   Jan  Suraj waiter (Adv Dec)  2000.0  04_Salary  Counter Book
3    2023-01-01   Jan  Ganesh Kumre (Adv Dec)   500.0  04_Salary  Counter Book
4    2023-01-01   Jan        Yogesh (Adv Dec)  1000.0  04_Salary  Counter Book
...         ...   ...                     ...     ...        ...           ...
1122 2023-07-20  July    Yuvraj full sal June  6500.0  04_Salary  Counter Book
1123        NaT   NaN                     NaN     NaN        NaN           NaN
1124 2023-07-21  July            French fries   380.0   01_Dairy  Counter Book
1125 2023-07-21  July                  Corn 2   240.0   01_Dairy  Counter Book
1126 2023-07-21  July    Pankaj full sal June  7800.0  04_Salary  Counter Book

[1127 rows x 6 columns]

In [4]:
expense_details = expense_details.dropna(how='all')
#removed unnecessary blank rows

In [5]:
expense_details

           Date Month         Expense Details  Amount   Catagory    Exp Source
0    2023-01-01   Jan             HPGas big 1  1950.0     02_Gas  Counter Book
1    2023-01-01   Jan            Live singing  5000.0    03_Misc  Counter Book
2    2023-01-01   Jan  Suraj waiter (Adv Dec)  2000.0  04_Salary  Counter Book
3    2023-01-01   Jan  Ganesh Kumre (Adv Dec)   500.0  04_Salary  Counter Book
4    2023-01-01   Jan        Yogesh (Adv Dec)  1000.0  04_Salary  Counter Book
...         ...   ...                     ...     ...        ...           ...
1121 2023-07-20  July          Ankit July adv  1000.0  04_Salary  Counter Book
1122 2023-07-20  July    Yuvraj full sal June  6500.0  04_Salary  Counter Book
1124 2023-07-21  July            French fries   380.0   01_Dairy  Counter Book
1125 2023-07-21  July                  Corn 2   240.0   01_Dairy  Counter Book
1126 2023-07-21  July    Pankaj full sal June  7800.0  04_Salary  Counter Book

[946 rows x 6 columns]

In [6]:
expense_details.to_excel("Expense-Details.xlsx", index = False)
#created a back-up

In [7]:
expense_details.drop("Month",axis=1,inplace=True)
#No need of months column the dates show the month

C:\Users\DELL\AppData\Local\Temp\ipykernel_9736\1269580459.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  expense_details.drop("Month",axis=1,inplace=True)

In [8]:
expense_details

           Date         Expense Details  Amount   Catagory    Exp Source
0    2023-01-01             HPGas big 1  1950.0     02_Gas  Counter Book
1    2023-01-01            Live singing  5000.0    03_Misc  Counter Book
2    2023-01-01  Suraj waiter (Adv Dec)  2000.0  04_Salary  Counter Book
3    2023-01-01  Ganesh Kumre (Adv Dec)   500.0  04_Salary  Counter Book
4    2023-01-01        Yogesh (Adv Dec)  1000.0  04_Salary  Counter Book
...         ...                     ...     ...        ...           ...
1121 2023-07-20          Ankit July adv  1000.0  04_Salary  Counter Book
1122 2023-07-20    Yuvraj full sal June  6500.0  04_Salary  Counter Book
1124 2023-07-21            French fries   380.0   01_Dairy  Counter Book
1125 2023-07-21                  Corn 2   240.0   01_Dairy  Counter Book
1126 2023-07-21    Pankaj full sal June  7800.0  04_Salary  Counter Book

[946 rows x 5 columns]

In [9]:
unique_values_exp_src = expense_details["Exp Source"].unique()
#checking if there is any other source of expences

In [10]:
unique_values_exp_src
#Expences are purely recorded with counter book

array(['Counter Book'], dtype=object)

In [11]:
expense_details.drop("Exp Source", axis=1, inplace=True)

C:\Users\DELL\AppData\Local\Temp\ipykernel_9736\2498295097.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  expense_details.drop("Exp Source", axis=1, inplace=True)

In [12]:
expense_details

           Date         Expense Details  Amount   Catagory
0    2023-01-01             HPGas big 1  1950.0     02_Gas
1    2023-01-01            Live singing  5000.0    03_Misc
2    2023-01-01  Suraj waiter (Adv Dec)  2000.0  04_Salary
3    2023-01-01  Ganesh Kumre (Adv Dec)   500.0  04_Salary
4    2023-01-01        Yogesh (Adv Dec)  1000.0  04_Salary
...         ...                     ...     ...        ...
1121 2023-07-20          Ankit July adv  1000.0  04_Salary
1122 2023-07-20    Yuvraj full sal June  6500.0  04_Salary
1124 2023-07-21            French fries   380.0   01_Dairy
1125 2023-07-21                  Corn 2   240.0   01_Dairy
1126 2023-07-21    Pankaj full sal June  7800.0  04_Salary

[946 rows x 4 columns]

In [13]:
unique_values_category = expense_details["Catagory"].unique()

In [14]:
unique_values_category

array(['02_Gas', '03_Misc', '04_Salary', '04_Samaj seva', '03_Petrol', '01_Kirana',
       '02_Electric bill', '04_ODC', '03_Cash Return', '01_Dairy', '03_Room Rent', '01_Vegetables',
       '01_Non Veg', '04_Salary OT', '03_Maintainance', '01_Egg', '02_Coal', '01_Mutton',
       '01_Chicken', '01_Fish'], dtype=object)

In [15]:
len(unique_values_category)
#So there are in total 20 unique places where the money has been used

20

In [16]:
unique_values_category_count = expense_details["Catagory"].value_counts()

In [17]:
unique_values_category_count
#count of the repetation of category

Catagory
04_Salary           417
03_Petrol           118
02_Gas               92
03_Misc              84
03_Maintainance      35
01_Kirana            32
04_Samaj seva        29
03_Cash Return       28
04_ODC               24
01_Dairy             18
01_Vegetables        17
04_Salary OT         15
03_Room Rent         11
02_Electric bill      9
02_Coal               6
01_Non Veg            3
01_Egg                3
01_Chicken            3
01_Mutton             1
01_Fish               1
Name: count, dtype: int64

In [18]:
unique_values_exp_details = expense_details["Expense Details"].unique()
#this gives the exact number of unique places where money was spent

In [19]:
len(unique_values_exp_details)

637

In [20]:
unique_values_exp_details_count = expense_details["Expense Details"].value_counts()

In [21]:
unique_values_exp_details_count

Expense Details
Bike petrol               45
Omni petrol               41
HP Gas small 1            24
HP gas small 1            19
Samaj seva                19
                          ..
Sarswati bai (Feb adv)     1
Omlal (Feb adv)            1
Cash return (M4)           1
Sumitra Bai (Feb adv)      1
Pankaj full sal June       1
Name: count, Length: 636, dtype: int64

In [22]:
unique_values_exp_details_count.to_excel("Unique-Expense-Details.xlsx")

In [23]:
expense_details.set_index("Date",inplace=True)

In [24]:
expense_details

                   Expense Details  Amount   Catagory
Date
2023-01-01             HPGas big 1  1950.0     02_Gas
2023-01-01            Live singing  5000.0    03_Misc
2023-01-01  Suraj waiter (Adv Dec)  2000.0  04_Salary
2023-01-01  Ganesh Kumre (Adv Dec)   500.0  04_Salary
2023-01-01        Yogesh (Adv Dec)  1000.0  04_Salary
...                            ...     ...        ...
2023-07-20          Ankit July adv  1000.0  04_Salary
2023-07-20    Yuvraj full sal June  6500.0  04_Salary
2023-07-21            French fries   380.0   01_Dairy
2023-07-21                  Corn 2   240.0   01_Dairy
2023-07-21    Pankaj full sal June  7800.0  04_Salary

[946 rows x 3 columns]